SPECIAL_CHARS = {
#Ää Àà Áá Ââ Ãã Åå Ǎǎ Ąą Ăă Ææ Āā #no ĄąĀā
'A¨ ':'Ä', 'a¨ ':'ä', 'A¨':'Ä', 'a¨':'ä',
'A` ':'À', 'a` ':'à', 'A`':'À', 'a`':'à', 
'A´ ':'Á', 'a´ ':'á', 'A´':'Á', 'a´':'á',
'Aˆ ':'Â', 'aˆ ':'â', 'Aˆ':'Â', 'aˆ':'â',
'A˜ ':'Ã', 'a˜ ':'ã', 'A˜':'Ã', 'a˜':'ã',
'A˚ ':'Å', 'a˚ ':'å', 'A˚':'Å', 'a˚':'å',
'Aˇ ':'Ǎ', 'aˇ ':'ǎ', 'Aˇ':'Ǎ', 'aˇ':'ǎ',
'A˘ ':'Ă', 'a˘ ':'ă', 'A˘':'Ă', 'a˘':'ă',
#ÇçĆćĈĉČč
'C¸ ':'Ç', 'c¸ ':'ç', 'C¸':'Ç', 'c¸':'ç',
'C´ ':'Ć', 'c´ ':'ć', 'C´':'Ć', 'c´':'ć',
'Cˆ ':'Ĉ', 'cˆ ':'ĉ', 'Cˆ':'Ĉ', 'cˆ':'ĉ',
'Cˇ ':'Č', 'cˇ ':'č', 'Cˇ':'Č', 'cˇ':'č',
#ĎđĐďð
'Dˇ ':'Ď', 'Dˇ':'Ď',
'd´ ':'ď', 'd´':'ď',
#Èè Éé Êê Ëë Ěě Ęę Ėė Ēē #no Ęę Ėė Ēē 
'E` ':'È', 'e` ':'è', 'E`':'È', 'e`':'è',
'E´ ':'É', 'e´ ':'é', 'E´':'É', 'e´':'é',
'Eˆ ':'Ê', 'eˆ ':'ê', 'Eˆ':'Ê', 'eˆ':'ê',
'E¨ ':'Ë', 'e¨ ':'ë',
'Eˇ ':'Ě', 'eˇ ':'ě', 'E¨':'Ë', 'e¨':'ë',

#ĜĝĢģĞğ
'Gˆ ':'Ĝ', 'gˆ ':'ĝ', 'Gˆ':'Ĝ', 'gˆ':'ĝ',
'G´ ':'Ģ', 'g´ ':'ģ', 'G´':'Ģ', 'g´':'ģ',
'G˘ ':'Ğ', 'g˘ ':'ğ', 'G˘':'Ğ', 'g˘':'ğ',
#Ĥĥ
'Hˆ ':'Ĥ', 'hˆ ':'ĥ', 'Hˆ':'Ĥ', 'hˆ':'ĥ',
#Ìì Íí Îî Ïï ı Īī Įį # no Īī Įį
'I` ':'Ì', 'ı` ':'ì', 'I`':'Ì', 'ı`':'ì', 
'I´ ':'Í', 'ı´ ':'í', 'I´':'Í', 'ı´':'í',
'Iˆ ':'Î', 'ıˆ ':'î', 'Iˆ':'Î', 'ıˆ':'î',
'I¨ ':'Ï', 'ı¨ ':'ï', 'I¨':'Ï', 'ı¨':'ï', 
#Ĵĵ
'Jˆ ':'Ĵ', 'Jˆ':'Ĵ',  # no ĵ
#Ķķ
'K´ ':'Ķ', 'k´ ':'ķ', 'K´':'Ķ', 'k´':'ķ',
#ĹĺĻļŁłĽľ  ???????
#'ll ':'ł',

#ÑñŃń ŇňŅņ
'N˜ ':'Ñ', 'n˜ ':'ñ', 'N˜':'Ñ', 'n˜':'ñ',
'N´ ':'Ń', 'n´ ':'ń', 'N´':'Ń', 'n´':'ń',
'Nˇ ':'Ň', 'nˇ ':'ň', 'Nˇ':'Ň', 'nˇ':'ň', 
#Öö Òò ÓóÔô Õõ # no ŐőØøŒœ
'O¨ ':'Ö', 'o¨ ':'ö', 'O¨':'Ö', 'o¨':'ö',
'O` ':'Ò', 'o` ':'ò', 'O`':'Ò', 'o`':'ò',
'O´ ':'Ó', 'o´ ':'ó', 'O´':'Ó', 'o´':'ó',
'Oˆ ':'Ô', 'oˆ ':'ô', 'Oˆ':'Ô', 'oˆ':'ô',
'O˜ ':'Õ', 'o˜ ':'õ', 'O˜':'Õ', 'o˜':'õ',

#ŔŕŘř
'R´ ':'Ŕ', 'r´ ':'ŕ',
'Rˇ ':'Ř', 'rˇ ':'ř',

#ẞß Śś Ŝŝ Şş Šš no Șș
'S´ ':'Ś', 's´ ':'ś', 'S´':'Ś', 's´':'ś',
'Sˆ ':'Ŝ', 'sˆ ':'ŝ', 'Sˆ':'Ŝ', 'sˆ':'ŝ',
'S¸ ':'Ş', 's¸ ':'ş', 'S¸':'Ş', 's¸':'ş',
'Sˇ ':'Š', 'sˇ ':'š', 'Sˇ':'Š', 'sˇ':'š',

#ŤťŢţ  # no ÞþȚț
'Tˇ ':'Ť', 'Tˇ':'Ť',
'T¸ ':'Ţ','t¸ ':'ţ', 'T¸':'Ţ','t¸':'ţ',

#ÜüÙù Úú Ûû Ũũ  Ůů # no Ūū Ųų Űű 
'U¨ ':'Ü', 'u¨ ':'ü', 'U¨':'Ü', 'u¨':'ü',
'U` ':'Ù', 'u` ':'ù', 'U`':'Ù', 'u`':'ù',
'U´ ':'Ú', 'u´ ':'ú', 'U´':'Ú', 'u´':'ú',
'Uˆ ':'Û', 'uˆ ':'û', 'Uˆ':'Û', 'uˆ':'û',
'U˜ ':'Ũ', 'u˜ ':'ũ', 'U˜':'Ũ', 'u˜':'ũ',
'U˚ ':'Ů', 'u˚ ':'ů', 'U˚':'Ů', 'u˚':'ů',

#Ŵŵ
'Wˆ ':'Ŵ', 'wˆ ':'ŵ', 'Wˆ':'Ŵ', 'wˆ':'ŵ',
#ÝýŸÿŶŷ
'Y´ ':'Ý', 'y´ ':'ý', 'Y´':'Ý', 'y´':'ý',
'Y¨ ':'Ÿ', 'y¨ ':'ÿ', 'Y¨':'Ÿ', 'y¨':'ÿ',
'Yˆ ':'Ŷ', 'yˆ ':'ŷ', 'Yˆ':'Ŷ', 'yˆ':'ŷ',
#ŹźŽž no Żż
'Z´ ':'Ź', 'z´ ':'ź', 'Z´':'Ź', 'z´':'ź',
'Zˇ ':'Ž', 'zˇ ':'ž', 'Zˇ':'Ž', 'zˇ':'ž',

'aÂ ':'á', 'aÂ':'á', 'AÂ ':'Á', 'AÂ':'Á',
'eÂ ':'é', 'eÂ':'é', 'EÂ ':'É', 'EÂ':'É',

'õÂ ':'í', 'õÂ':'í', 
'oÂ ':'ó', 'oÂ':'ó', 'OÂ ':'Ó', 'OÂ':'Ó',
'oÈ ':'ö', 'oÈ':'ö', 'OÈ ':'Ö', 'OÈ ':'Ö',

'uÂ ':'ú', 'uÂ':'ú', 'UÂ ':'Ú', 'UÂ':'Ú',
'uÈ ':'ü', 'uÈ':'ü', 'UÈ ':'Ü', 'UÈ':'Ü',
'sË ':'ş', 'sË':'ş', 'SË ':'Ş', 'SË':'Ş',
'nÂ ':'ń', 'nÂ':'ń', 'NÂ ':'Ń', 'NÂ':'Ń',
}
"""
¡¿
ÄäÀàÁáÂâÃãÅåǍǎĄąĂăÆæĀā
ÇçĆćĈĉČč
ĎđĐďð
ÈèÉéÊêËëĚěĘęĖėĒē
ĜĝĢģĞğ
Ĥĥ
ÌìÍíÎîÏïıĪīĮį
Ĵĵ
Ķķ
ĹĺĻļŁłĽľ  
ÑñŃńŇňŅņ
ÖöÒòÓóÔôÕõŐőØøŒœ
ŔŕŘř
ẞßŚśŜŝŞşŠšȘș
ŤťŢţÞþȚț
ÜüÙùÚúÛûŰűŨũŲųŮůŪū
Ŵŵ
ÝýŸÿŶŷ
ŹźŽžŻż
"""